window.addEventListener("load", solve);

function solve() {
  const main = document.getElementById("main-content");
  const routes = Array.from(document.getElementsByClassName("route")).forEach(
    (el) => el.addEventListener("click", changeRoute)
  );

  function changeRoute(ev) {
    const route = ev.target.textContent;

    if (route === "Най-високи") {
      main.innerHTML = `
            <h1 id="biggestWaterfalls-h1">Десетте най-високи водопада в България</h1>
            <div class="waterfall">
                <img src="/recources/images/vrachanskaSkaklq.png" alt="Врачанска Скакля">
                <div class="text">
                    <h2>1. Кръстилница</h2>
                    <p id="waterfall-p">Кръстилницата е най-високият водопад в България с височина от 141 метра. Той се намира в Рила планина и е един от най-посещаваните водопади в страната. Водите му падат от внушителен скален венец и се виждат отдалеч. Най-подходящи периоди за посещение са пролетно време и след обилни дъждове.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/rajskoPraskalo.png" alt="Райско пръскало">
                <div class="text">
                    <h2>2. Райското пръскало</h2>
                    <p id="waterfall-p">Райското пръскало е най-високият постоянен водопад в България и на Балканския полуостров - 124,5 m. Намира се в Стара планина, на южния склон под най-високия старопланински връх – Ботев. На територията е на природен резерват „Джендема“, част от Национален парк „Централен Балкан“. Обявен е за защитен природен обект през 1965 г.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/bovskaSkaklq.png" alt="Бовска Скакля">
                <div class="text">
                    <h2>3. Бовска Скакля</h2>
                    <p id="waterfall-p">Водопад Бовска Скакля се намира в Искърското дефиле на Вазовата екопътека, близо до село Бов. Неговата река също не е от големите. Затова и силните му дни са през пролетта и след обилни дъждове. Под него минава известната Вазова пътека. Наблизо е и скалата, наречена Злия камък, от която Вазовият герой дядо Йоцо е „гледал“ със слепите си разплакани очи първия влак по Искърското дефиле, символ на Нова България.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/vidimskoPraskalo.png" alt="Видимско пръскало">
                <div class="text">
                    <h2>4. Видимско пръскало</h2>
                    <p id="waterfall-p">Видимското пръскало е водопад, намиращ се в Средна Стара планина, в резервата „Северен Джендем“, част от Национален парк „Централен Балкан“. Той е един от най-високите водопади в България – 80 метра. Намира се в източната част на Северния Джендем. Водата му се събира от три поточета, извиращи малко под главното старопланинско било в района между седловината Пилешки полог и връх Юрушка грамада, течащи на северозапад. В началото те се спускат по тревистия склон, съединяват се и достигайки до отвесен скален венец, скачат от височина 80 метра.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/kademlijskoPraskalo.png" alt="Кадемлийско пръскало">
                <div class="text">
                    <h2>5. Кадемлийско пръскало</h2>
                    <p id="waterfall-p">Водопад Кадемлийско пръскало се намира на река Кадемлийска, десен приток на река Тъжа, в Национален парк „Централен Балкан“. Близо до водопада е старопланинската хижа Тъжа.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/rilskaSkakavica.png" alt="Рилска Скакавица">
                <div class="text">
                    <h2>6. Рилска Скакавица</h2>
                    <p id="waterfall-p">Водопад Рилска Скакавица, със своите 70 метра височина, е най-високият водопад в Рила. Разположен е на 1750 метра надморска височина, а местността покрай него е много красива. Реката, която го захранва се нарича Скакавица, а преходът до него не е труден и е по добре маркирана пътека. Тръгва се от местността Зелени преслап след Паничище.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/samodivskoPraskalo.png" alt="Водопад Самодивско пръскало">
                <div class="text">
                    <h2>7. Водопад Самодивско пръскало</h2>
                    <p id="waterfall-p">Водопад Самодивско пръскало е най-високият в Родопите. Намира се до Девин. Водите му падат на два пада с обща височина от 70 метра. В подножието на водопада се вижда долният пад. За да го видите в целия му ръст, трябва да поемете към близкия хълм Калето и на една от отбивките да кривнете към ръба на хребета, откъдето се открива панорамна гледка към двата пада на Самодивското пръскало.

                    Водопадът е една от забележителностите по една от най-атрактивните екопътеки в България – Струилица.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/orfej.png" alt="Водопад Орфей">
                <div class="text">
                    <h2>8. Водопад Орфей</h2>
                    <p id="waterfall-p">Водопад Орфей е вторият по височина водопад в Родопите. Намира се на река Еленска близо до Смолян по известната екопътека „Каньона на водопадите“. Водите му се сипят от висока скала под формата на лира.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/borovKamuk.png" alt="Боров камък">
                <div class="text">
                    <h2>9. Боров камък</h2>
                    <p id="waterfall-p">Водопад Боров камък е единият от Врачанските водопади. Другият е Врачанската Скакля – първият в списъка. Водопадът е много красив и до него се стига по интересна и на места екстремна екопътека. Реката на водопада е Лева – същата с онова красиво ждрело край град Враца – Вратцата. Пътеката започва в покрайнините на врачанското село Згориград. Освен големият водопад Боров камък, по нея могат да се наблюдават още много, при това красиви водопади.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/babskoPraskalo.png" alt="Бабско Пръскало">
                <div class="text">
                    <h2>10. Бабско Пръскало</h2>
                    <p id="waterfall-p">Още един от водопадите в Национален парк „Централен Балкан“, пълноводен през цялата година. Преди време до него е водела екопътека, но сега тя е разрушена и до него се стига трудно. Може да се види отдалеч по маршрута от село Тъжа към водопад Кадемлийско пръскало.</p>
                </div>
            </div>
            `;
    } else if (route === "Легенди") {
      main.innerHTML = `
            <h1 id="biggestWaterfalls-h1">Легенди за водопади в България</h1>
            <div class="waterfall">
                <img src="/recources/images/gorica.png" alt="Водопад Горица">
                <div class="text">
                    <h2>Легенда за Водопад Горица</h2>
                    <p id="waterfall-p">Водопадът Горица е един от седемте Овчаренски водопада, намиращи се в северното подножие на Рила планина, близо до село Овчарци.

                    Името на реката и на водопада произлиза от историята на красива девойка от селото на име Горица, която живеела щастливо с избраника си овчаря Йовица.
                    
                    Мълвата за красотата на девойката достигнала до местния турски бей, който изпратил хора да я отвлекат. Младата мома побегнала към планината, където Йовица пасял овцете си, но турците я настигнали.
                    
                    За да се спаси от тях, красивата девойка се хвърлила в реката от високата скала, а местните хора нарекли близкия водопад и реката на нейно име.</p>
                </div>
            </div>
            <div class="waterfall">
                <img src="/recources/images/bovskaSkaklq(2).png" alt="Райско пръскало">
                <div class="text">
                    <h2>Легенда за Скакля</h2>
                    <p id="waterfall-p">Било към края на турското робство. Покрай водопада минала турска потеря. Уморените воини замръкнали в подножието му. Там прекарали нощта. Изгряла златна зората и позлатили първите слънчеви лъчи пенливите и скокливи води тъй, че смаян от тази невиждана хубост, пашата възкликнал: “Машала… Скакля”. Напомнила му омайната гледка за една ханъма от неговия харем, за една ханъма-балканджийка…

                    Тъй безименният дотогава водопад бил кръстен от турчина с гальовното име “Скакля”.</p>
                </div>
            </div>
            <div class="waterfall">
                <img src="/recources/images/vodopadOrfej.png" alt="Водопад Орфей">
                <div class="text">
                    <h2>Легенда за Водопад Орфей</h2>
                    <p id="waterfall-p">Водопад Орфей не случайно носи това име. Родопите са смятани за планината на магичния Орфей. Той бил толкова вдъхновен от природата, че можел да пее и свири на арфата си на своята любима Евридика.

                    Според една легенда, именно там е била скрита арфата на Орфей, затова когато водата се стича по стръмните склонове на скалите, прилича на арфа, а звуците са толкова мелодични, сякаш са дело на самия Орфей.</p>
                </div>
            </div>
            `;
    } else if (route === "Най-красиви") {
      main.innerHTML = `
            <h1 id="biggestWaterfalls-h1">Най-красивите водопади в България</h1>
            <div class="waterfall">
                <img src="/recources/images/kanionutNaVodopadite.png" alt="Каньонът на водопадите">
                <div class="text">
                    <h2>Каньонът на водопадите</h2>
                    <p id="waterfall-p">Непременно посетете екопътека Каньонът на водопадите до Смолян. Водопадите по нея наистина са сред най-красивите в България. Най-големият е "Орфей", със своите 68 метра, но "Сърцето" и "Камен улей"не му отстъпват по очарование. Екопътеката е изключително добре поддържана. За да се насладите на впечатляващи панорамни гледки, можете да използвате трите специално изградени площадки. Макар че целият преход е около четири часа, не е толкова труден, колкото този до Райското пръскало. Подходящ е и за деца.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/krushunskiVodopadi.png" alt="Крушунски водопади">
                <div class="text">
                    <h2>Крушунски водопади</h2>
                    <p id="waterfall-p">Те са сред най-лесно достъпните и сред най-популярните. Забележителни са с травертинова каскада с прагове и басейни, а местността е интересна и с растителните си и животински видове. Най-големият водопад се спуска от 20 метра в няколко ръкава. Екопътеката открива изумителен хоризонт, останалото е просто плод на будното ви въображение, а тук то просто се развихря на воля. За мнозина Крушунските водопади са сред най-възхителните не само в България, а местността сякаш прегръща гостите си.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/hotnishkiVodopad.png" alt="Хотнишки водопад">
                <div class="text">
                    <h2>Хотнишки водопад</h2>
                    <p id="waterfall-p">Известен е и като "Кая Бунар". След Крушунските водопади, вероятно е най-популярният и лесно достъпен. Намира се на около 15 км от Велико Търново и пленява не само като природен феномен. Носи дори екзотичност и бихте могли да си го представите в някоя далечна точка на света. Неслучайно има и световна слава. Местността е приказна, а мостчетата по екопътеката дават възможност да се насладите на невероятни природни картини.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/vidimskoPraskalo.png" alt="Сливовдолско падало">
                <div class="text">
                    <h2>Сливовдолско падало</h2>
                    <p id="waterfall-p">50-метровият водопад е най-високият в Родопите и се намира в резерват "Червената стена", след Бачково. Каскадите и останалите малки водопади сред прохладната гора са прекрасни. Лесно можете да стигнете до него само за около час по пътека, започваща малко след Бачково, или пък от хижа Марциганица.</p>
                </div>
            </div>
            `;
    } else if (route === "Лесно достъпни") {
      main.innerHTML = `
            <h1 id="biggestWaterfalls-h1">Четири лесно достъпни водопада в България</h1>

            <div class="waterfall">
                <img src="/recources/images/glojenskiVodopad.png" alt="Гложенски водопад">
                <div class="text">
                    <h2> Гложенски водопад</h2>
                    <p id="waterfall-p">Гложенският водопад се намира (ако изобщо го има) след село Гложене на път към Тетевен, точно над едно крайпътно заведение. Водопадът се вижда от шосето, а там пред заведението може да спрете да го разгледате. То всъщност е разположен на едва около 440 метра надморска височина. Макар и намиращ се в планинска местност, той все пак остава в по-ниско лежаща област.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/bovskaSkaklq(3).png" alt="Бовска Скакля">
                <div class="text">
                    <h2> Бовска Скакля</h2>
                    <p id="waterfall-p">Водопад Бовска Скакля се намира недалеч от селата Гара Бов и Заселе. Дотам можете да стигнете с влак – до гара Бов, или с кола – за по-малко от час от София. Височината на водопада – част от едноименната река Скакля, е 85 м. Дотук съм идвала много пъти – понякога, за да се порадвам на сипещите се надолу води, друг път – с идеята да мина „Вазовата пътека“.

                    Природата в района е приказна, като за това в голяма степен допринася и самият водопад. За съжаление, ако отидете в разгара на лятото, е възможно да го откриете напълно пресъхнал. Но на пролет ще ви разкрие цялото си величие – горната снимка например е от месец април. А през зимата можете да се насладите на вълшебните му вледенени форми. Разстоянието от жп гарата до водопада отнема по-малко от час ходене и е лесно за преминаване при всякакви климатични условия.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/krushunskiVodopadi(2).png" alt="Крушунски водопади, до Ловеч">
                <div class="text">
                    <h2> Крушунски водопади, до Ловеч</h2>
                    <p id="waterfall-p">Крушунските водопади представляват най-дългата травертинова каскада в страната, намират се на северния склон на Деветашкото плато и са се образували по протежение на р. Пройновска, която извира от Крушунската пещера. Първият и най-голям водопад – с височина от около 20 м, е Пръскалото. По пътя си през пътеката ще минете по множество дървени мостчета, ще се насладите на приказните каскади, ще можете дори да застанете под сипещите се над вас пръски. А водата не е изумрудена само на снимките. Това е нейният действителен цвят, дължащ се на варовиковите отлагания в заобикалящите водопадите скали.
                    <br>
                    <br>
                    Ако сте отишли дотам специално заради водопадите (които няма да ви отнемат повече от 2 часа със снимките и почивките), можете да отделите време и за посещение на някоя от пещерите в района – Маарата, Урушка Маара, Бонинска пещера, Деветашката и др.</p>
                </div>
            </div>

            <div class="waterfall">
                <img src="/recources/images/boqnskiVodopad.png" alt="Боянски водопад, до София">
                <div class="text">
                    <h2>Боянски водопад, до София</h2>
                    <p id="waterfall-p">Разположен е в планина Витоша, лежи на течението на малката Боянска река, височината му е 25 м, а надморската височина – 1330 м. Основните маршрути до него са 4, като аз съм минавала по 3 от тях. Най-популярният води началото си от кв. Бояна, докъдето можете да стигнете с автобус 64 (спирката се нарича „Боянско ханче“). След това е достатъчно само да следвате табелите към Боянската църква (до която също препоръчвам да се отбиете). Когато навлезете в гората, ще видите ясна маркировка. Вариантите пред вас ще са два:
                    <br>
                    <br>
                    - да потеглите по реката - по-стръмен и непрепоръчителен в случай на голямо пълноводие маршрут (от личен опит го казвам);
                    <br>
                    <br>
                    - да изберете заобиколния и по-полегат път покрай Боянското езеро, което не бих нарекла живописно, но не пречи да го видите, ако сте в района.</p>
                </div>
            </div>
            </div>`;
    } else if (route === "Информация за сайта") {
      main.innerHTML = `
            <div id="infoPage-contaniner">        
            <span id="span-creators">Участниците в проекта:</span>

                <ul id="creators">   
                    <li>Слави Караславов</li>
                    <li>Теодор Баненски</li>
                    <li>Мария Дрезгачева</li>
                </ul>

                <hr id="only-hr">

                <p id="information-p">
                    Главната информация представена в този сайт е придобита <br> от следователните два сайта:
                </p>

                <div id="site-links">
                    <a id="first-link" href="https://www.wikipedia.org" target="_blank"><img src="/recources/images/wikipediaLogo.png" alt="уикипедия">
                    <a id="second-link" href="https://travelagency.bg" target="_blank"><img src="/recources/images/travelagencyBg.png" alt="туристическа агенция">
                </div>

            </div>`;
    } else if (route === "Допълнителна информация") {
      main.innerHTML = `
            <div id="infoPage-contaniner">  
                <h1 id="home-title">Допълнителна информация</h1>

                <ul>
                    <li class="more-info">Крушунски водопади - 
                        <a href="https://waterfallsbg.info/крушунски-водопади" target="_blank">
                            waterfallsbg.info
                        </a>
                    </li>
                    <li class="more-info">
                        Райското Праскало - 
                        <a href="https://www.nasamnatam.com/statia/Vodopad_Raiskoto_pryskalo_bojestvena_staroplaninska_gledka-3786.html" 
                           target="_blank">www.nasamnatam.com
                        </a>
                    </li>
                    <li class="more-info">Бовска Скакля - 
                        <a href="https://oilaripi.com/bg/page/atlas/details/1116-vodopad-bovska-skaklya"  target="_blank">
                            oilaripi.com
                        </a>
                    </li>
                    <li class="more-info">Кадемлийско Праскало - 
                        <a href="https://svetogled.com/kademlijsko-pryskalo-vryh-maragidik/"  target="_blank">
                            svetogled.com
                        </a>
                    </li>
                    <li class="more-info">Сливовдолско Праскало - 
                        <a href="https://drumivdumi.com/водопад-сливодолско-падало-бачково/"  target="_blank">
                            drumivdumi.com
                        </a>
                    </li>
                    <li class="more-info">Водопад Орфей - 
                        <a href="https://opoznai.bg/view/vodopad-orfei-i-kaniona-na-vodopadite-smolian"  target="_blank">
                            opoznai.bg
                        </a>
                    </li>
                    <li class="more-info">Самодивско Праскало - 
                        <a href="https://pateka.im/vodopad-samodivsko-praskalo/"  target="_blank">
                            pateka.im
                        </a>
                    </li>
                    <li class="more-info">Бабско Праскало - 
                        <a href="https://izbulgaria.com/водопад-бабско-пръскало/"  target="_blank">
                            izbulgaria.com
                        </a>
                    </li>
                </ul>
            </div>  
            `;
    } else {
      main.innerHTML = `
            <h1 id="home-title">Водопади в България</h1>
            <p id="home-description">Тук можете да намерите информация за множество водопади в България.
            </p>
            <img id="waterfall-image" src="/recources/images/waterfall.png" alt="waterfall">
            `;
    }
  }
}
